---
kind: method
id: M:Autodesk.Revit.DB.ReferencePointArray.ReverseIterator
source: html/710a8610-f412-b915-6fac-bf769ad5bac2.htm
---
# Autodesk.Revit.DB.ReferencePointArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual ReferencePointArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.